esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS2Host.cpp
/*
    LEAmDNS2Host.cpp

    License (MIT license):
      Permission is hereby granted, free of charge, to any person obtaining a copy
      of this software and associated documentation files (the "Software"), to deal
      in the Software without restriction, including without limitation the rights
      to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
      copies of the Software, and to permit persons to whom the Software is
      furnished to do so, subject to the following conditions:

      The above copyright notice and this permission notice shall be included in
      all copies or substantial portions of the Software.

      THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
      IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
      FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
      AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
      LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
      OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
      THE SOFTWARE.

*/

#include <algorithm>

#include "ESP8266mDNS.h"
#include "LEAmDNS2Host.h"

#ifdef MDNS_IPV4_SUPPORT
#include <lwip/igmp.h>
#endif
#ifdef MDNS_IPV6_SUPPORT
#include <lwip/mld6.h>
#endif

/**
    STRINGIZE
*/
#ifndef STRINGIZE
#define STRINGIZE(x) #x
#endif
#ifndef STRINGIZE_VALUE_OF
#define STRINGIZE_VALUE_OF(x) STRINGIZE(x)
#endif

namespace   // anonymous
{

/*
    strrstr (static)

    Backwards search for p_pcPattern in p_pcString
    Based on: https://stackoverflow.com/a/1634398/2778898

*/
const char* strrstr(const char*__restrict p_pcString,
                    const char*__restrict p_pcPattern)
{
    const char* pcResult = 0;

    size_t      stStringLength = (p_pcString ? strlen(p_pcString) : 0);
    size_t      stPatternLength = (p_pcPattern ? strlen(p_pcPattern) : 0);

    if ((stStringLength) &&
            (stPatternLength) &&
            (stPatternLength <= stStringLength))
    {
        // Pattern is shorter or has the same length than the string
        for (const char* s = (p_pcString + stStringLength - stPatternLength); s >= p_pcString; --s)
        {
            if (0 == strncmp(s, p_pcPattern, stPatternLength))
            {
                pcResult = s;
                break;
            }
        }
    }
    return pcResult;
}


} // anonymous


namespace esp8266
{


namespace experimental
{


/*

    HELPERS

*/

/*
    clsLEAmDNS2_Host::indexDomainName (static)

    Increments the given domain 'p_pcDomainName' by appending a delimiter and an index number.

    If the given domain name already has a numeric index (after the given delimiter), this index
    is incremented. If not, the delimiter and index '2' is added.

    If 'p_pcDomainName' is empty (==0), the given default name 'p_pcDefaultDomainName' is used,
    if no default is given, 'ESP8266' is used.

*/
//static

clsLEAMDNSHost::fnProbeResultCallback clsLEAMDNSHost::stProbeResultCallback = nullptr;

const char* clsLEAMDNSHost::indexDomainName(const char* p_pcDomainName,
        const char* p_pcDivider /*= "-"*/,
        const char* p_pcDefaultDomainName /*= 0*/)
{
    static char acResultDomainName[clsConsts::stDomainLabelMaxLength];
    *acResultDomainName = 0;

    // Ensure a divider exists; use '-' as default
    const char* pcDivider = (p_pcDivider ? : "-");

    if (p_pcDomainName)
    {
        // Given domain
        const char* pFoundDivider = strrstr(p_pcDomainName, pcDivider);
        if (pFoundDivider)          // maybe already extended
        {
            char*         pEnd = 0;
            unsigned long ulIndex = strtoul((pFoundDivider + strlen(pcDivider)), &pEnd, 10);
            if ((ulIndex) &&
                    ((pEnd - p_pcDomainName) == (ptrdiff_t)strlen(p_pcDomainName)) &&
                    (!*pEnd))
            {
                // Valid (old) index found
                char    acIndexBuffer[16];
                sprintf(acIndexBuffer, "%lu", (++ulIndex));
                //size_t  stLength = ((pFoundDivider - p_pcDomainName + strlen(pcDivider)) + strlen(acIndexBuffer) + 1);

                memcpy(acResultDomainName, p_pcDomainName, (pFoundDivider - p_pcDomainName + strlen(pcDivider)));
                acResultDomainName[pFoundDivider - p_pcDomainName + strlen(pcDivider)] = 0;
                strcat(acResultDomainName, acIndexBuffer);
            }
            else
            {
                pFoundDivider = 0;  // Flag the need to (base) extend the hostname
            }
        }

        if (!pFoundDivider)
        {
            // not yet extended (or failed to increment extension) -> start indexing
            //size_t    stLength = strlen(p_pcDomainName) + (strlen(pcDivider) + 1 + 1);   // Name + Divider + '2' + '\0'
            sprintf(acResultDomainName, "%s%s2", p_pcDomainName, pcDivider);
        }
    }
    else
    {
        // No given domain, use base or default
        const char* cpcDefaultName = (p_pcDefaultDomainName ? : "ESP8266");
        size_t      stLength = strlen(cpcDefaultName) + 1;   // '\0'
        strncpy(acResultDomainName, cpcDefaultName, stLength);
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("[mDNS] indexDomainName: From '%s' to '%s'\n"), (p_pcDomainName ? : ""), acResultDomainName););
    return acResultDomainName;
}


/*
    clsLEAmDNS2_Host::setStationHostName (static)

    Sets the staion hostname

*/
// static
bool clsLEAMDNSHost::setNetIfHostName(const char* p_pcHostName)
{
    if (p_pcHostName)
        for (netif* pNetIf = netif_list; pNetIf; pNetIf = pNetIf->next)
            if (netif_is_up(pNetIf))
            {
                netif_set_hostname(pNetIf, p_pcHostName);
                DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("[mDNS] setNetIfHostName host name: %s on " NETIFID_STR "!\n"), p_pcHostName, NETIFID_VAL(pNetIf)););
            }
    return true;
}


/**
    clsLEAmDNS2_Host::sm_pBackbone

*/
clsLEAMDNSHost::clsBackbone* clsLEAMDNSHost::clsBackbone::sm_pBackbone  = 0;

/**
    Consts::...

*/
const char* clsLEAMDNSHost::clsConsts::pcLocal                        = "local";
const char* clsLEAMDNSHost::clsConsts::pcServices                     = "services";
const char* clsLEAMDNSHost::clsConsts::pcDNSSD                        = "dns-sd";
const char* clsLEAMDNSHost::clsConsts::pcUDP                          = "udp";
//const char* clsLEAMDNSHost::clsConsts::pcTCP                          = "tcp";

#ifdef MDNS_IPV4_SUPPORT
const char* clsLEAMDNSHost::clsConsts::pcReverseIPv4Domain            = "in-addr";
#endif
#ifdef MDNS_IPV6_SUPPORT
const char* clsLEAMDNSHost::clsConsts::pcReverseIPv6Domain            = "ip6";
#endif
const char* clsLEAMDNSHost::clsConsts::pcReverseTopDomain             = "arpa";


