esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS2Host.cpp
/*
    clsLEAmDNS2_Host::clsLEAmDNS2_Host constructor

*/
clsLEAMDNSHost::clsLEAMDNSHost(void)
    :   m_pUDPContext(0),
        m_pcHostName(0),
        m_pcDefaultInstanceName(0),
        m_ProbeInformation()
{
}

/*
    clsLEAmDNS2_Host::~clsLEAmDNS2_Host destructor

*/
clsLEAMDNSHost::~clsLEAMDNSHost(void)
{
    close();
}

/*

    INIT

*/

/*
    clsLEAmDNS2_Host::begin (hostname, probe_callback)

    setup global mDNS (adding all netif to the multicast groups),
    sets up the instance data (hostname, ...) and starts the probing process

*/
bool clsLEAMDNSHost::begin(const char* p_pcHostName,
                           clsLEAMDNSHost::fnProbeResultCallback p_fnCallback /*= 0*/)
{
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s begin(%s)\n"), _DH(), (p_pcHostName ? : "_")););

    bool    bResult = false;

    if (!((bResult = ((setHostName(p_pcHostName)) &&
                      (_joinMulticastGroups()) &&
                      (p_fnCallback ? setProbeResultCallback(p_fnCallback) : true) &&
                      ((m_pUDPContext = _allocBackbone())) &&
                      (restart())))))
    {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s begin: FAILED for '%s'!\n"), _DH(), (p_pcHostName ? : "-")););
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s begin: %s to init with hostname %s!\n"), _DH(), (bResult ? "Succeeded" : "FAILED"), (p_pcHostName ? : "-")););
    return bResult;
}

/*
    clsLEAmDNS2_Host::close

*/
bool clsLEAMDNSHost::close(void)
{
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s close\n"), _DH()););

    m_pUDPContext = 0;
    return ((_leaveMulticastGroups()) &&
            (_releaseBackbone()));
}


/*

    HOSTNAME

*/

/*
    clsLEAmDNS2_Host::setHostName

*/
bool clsLEAMDNSHost::setHostName(const char* p_pcHostName)
{
    bool    bResult;
    if ((bResult = _allocHostName(p_pcHostName)))
    {
        m_ProbeInformation.clear(false);
        m_ProbeInformation.m_ProbingStatus = clsProbeInformation_Base::enuProbingStatus::ReadyToStart;

        // Replace 'auto-set' service names
        for (clsService* pService : m_Services)
        {
            if ((pService->m_bAutoName) &&
                    (!m_pcDefaultInstanceName))
            {
                if (!((bResult = pService->setInstanceName(p_pcHostName))))
                {
                    break;
                }
            }
        }
    }
    return bResult;
}

/*
    clsLEAmDNS2_Host::indexHostName

*/
bool clsLEAMDNSHost::indexHostName(void)
{
    return setHostName(clsLEAMDNSHost::indexDomainName(hostName(), "-", 0));
}

/*
    clsLEAmDNS2_Host::hostName

*/
const char* clsLEAMDNSHost::hostName(void) const
{
    return m_pcHostName;
}

/*
    clsLEAmDNS2_Host::setProbeResultCallback

*/
bool clsLEAMDNSHost::setProbeResultCallback(clsLEAMDNSHost::fnProbeResultCallback p_fnCallback)
{
    m_ProbeInformation.m_fnProbeResultCallback = p_fnCallback;
    return true;
}

/*
    clsLEAmDNS2_Host::probeStatus

*/
bool clsLEAMDNSHost::probeStatus(void) const
{
    return (clsProbeInformation_Base::enuProbingStatus::DoneFinally == m_ProbeInformation.m_ProbingStatus);
}


/*

    SERVICES

*/

/*
    clsLEAmDNS2_Host::setDefaultInstanceName

*/
bool clsLEAMDNSHost::setDefaultInstanceName(const char* p_pcDefaultInstanceName)
{
    bool    bResult;
    if ((bResult = _allocDefaultInstanceName(p_pcDefaultInstanceName)))
    {
        // Replace 'auto-set' service names
        for (clsService* pService : m_Services)
        {
            if (pService->m_bAutoName)
            {
                if (!((bResult = pService->setInstanceName(p_pcDefaultInstanceName))))
                {
                    break;
                }
            }
        }
    }
    return bResult;
}

/*
    clsLEAmDNS2_Host::defaultInstanceName

*/
const char* clsLEAMDNSHost::defaultInstanceName(void) const
{
    return m_pcDefaultInstanceName;
}

/*
    clsLEAmDNS2_Host::addService

*/
clsLEAMDNSHost::clsService* clsLEAMDNSHost::addService(const char* p_pcInstanceName,
        const char* p_pcType,
        const char* p_pcProtocol,
        uint16_t p_u16Port,
        clsLEAMDNSHost::clsService::fnProbeResultCallback p_fnCallback /*= 0*/)
{
    clsService* pService = 0;

    if (!((pService = findService(_instanceName(p_pcInstanceName), p_pcType, p_pcProtocol, p_u16Port))))
    {
        // Not already used
        if ((pService = new clsService))
        {
            if ((pService->setInstanceName(_instanceName(p_pcInstanceName))) &&
                    (pService->setType(p_pcType)) &&
                    (pService->setProtocol(p_pcProtocol)) &&
                    (pService->setPort(p_u16Port)) &&
                    (p_fnCallback ? pService->setProbeResultCallback(p_fnCallback) : true))
            {
                m_Services.push_back(pService);
            }
            else
            {
                delete pService;
                pService = 0;
            }
        }
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s addService: %s to add service '%s.%s.%s.local'!\n"), _DH(pService), (pService ? "Succeeded" : "FAILED"), _instanceName(p_pcInstanceName, false), (p_pcType ? : ""), (p_pcProtocol ? : "")););
    DEBUG_EX_ERR(if (!pService) DEBUG_OUTPUT.printf_P(PSTR("%s addService: FAILED to add service '%s.%s.%s.local'!\n"), _DH(pService), _instanceName(p_pcInstanceName, false), (p_pcType ? : ""), (p_pcProtocol ? : "")););
    return pService;
}

/*
    clsLEAmDNS2_Host::removeService

*/
bool clsLEAMDNSHost::removeService(clsLEAMDNSHost::clsService* p_pService)
{
    bool    bResult = false;

    if (p_pService &&
            (m_Services.end() != std::find(m_Services.begin(), m_Services.end(), p_pService)))
    {
    	bResult = _announceService(*p_pService, false);
 /*
        for (netif* pNetIf = netif_list; pNetIf; pNetIf = pNetIf->next)
            if (netif_is_up(pNetIf) &&
                    (_announceService(pNetIf, *p_pService, false)))
            {
                bResult = true;
            }
*/
    }

