esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS2Host.cpp
    if (bResult)
    {
        m_Services.remove(p_pService);
        delete p_pService;
    }
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf_P(PSTR("%s _removeService: FAILED!\n"), _DH(p_pService)););
    return bResult;
}

/*
    clsLEAmDNS2_Host::findService (const)

*/
const clsLEAMDNSHost::clsService* clsLEAMDNSHost::findService(const char* p_pcInstanceName,
        const char* p_pcType,
        const char* p_pcProtocol,
        uint16_t p_u16Port/*= (uint16_t)(-1)*/) const
{
    clsService* pFoundService = 0;

    for (clsService* pService : m_Services)
    {
        if ((0 == strcmp(pService->instanceName(), _instanceName(p_pcInstanceName))) &&
                (0 == strcmp(pService->type(), p_pcType)) &&
                (0 == strcmp(pService->protocol(), p_pcProtocol)) &&
                (((uint16_t)(-1) == p_u16Port) ||
                 (pService->port() == p_u16Port)))
        {
            pFoundService = pService;
            break;
        }
    }
    return pFoundService;
}

/*
    clsLEAmDNS2_Host::findService

*/
clsLEAMDNSHost::clsService* clsLEAMDNSHost::findService(const char* p_pcInstanceName,
        const char* p_pcType,
        const char* p_pcProtocol,
        uint16_t p_u16Port /*= (uint16_t)(-1)*/)
{
    return (clsService*)((const clsLEAMDNSHost*)this)->findService(p_pcInstanceName, p_pcType, p_pcProtocol, p_u16Port);
}

/*
	clsLEAMDNSHost::services

*/
const clsLEAMDNSHost::clsService::list& clsLEAMDNSHost::services(void) const
{
    return m_Services;
}


/*

    QUERIES

*/

/*
    clsLEAmDNS2_Host::queryService

*/
clsLEAMDNSHost::clsQuery::clsAnswerAccessor::vector clsLEAMDNSHost::queryService(const char* p_pcService,
        const char* p_pcProtocol,
        const uint16_t p_u16Timeout)
{
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s queryService '_%s._%s.local'\n"), _DH(), p_pcService, p_pcProtocol););

    clsLEAMDNSHost::clsQuery::clsAnswerAccessor::vector ret;

    if (_removeLegacyQuery() &&
            (p_pcService) && (*p_pcService) &&
            (p_pcProtocol) && (*p_pcProtocol) &&
            (p_u16Timeout))
    {
        std::list<clsQuery*> queries;

                clsQuery*    pQuery = 0;
                if (((pQuery = _allocQuery(clsQuery::enuQueryType::Service))) &&
                        (_buildDomainForService(p_pcService, p_pcProtocol, pQuery->m_Domain)))
                {
                    if (((pQuery->m_bStaticQuery = true)) && (_sendQuery(*pQuery)))
                    {
                        queries.push_back(pQuery);
                    }
                    else
                    {
                        // FAILED to send query
                        _removeQuery(pQuery);
                    }
                }

        if (queries.size())
        {
            // Wait for answers to arrive
            DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s queryService: Waiting %u ms for answers...\n"), _DH(), p_u16Timeout););
            //XXXFIXME could this delay be ASYNC?
            delay(p_u16Timeout);

            // All answers should have arrived by now -> stop adding new answers
            for (auto& q : queries)
            {
                q->m_bAwaitingAnswers = false;
                ret.insert(ret.end(), std::make_move_iterator(q->answerAccessors().begin()), std::make_move_iterator(q->answerAccessors().end()));
            }
        }
        else
        {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s queryService: INVALID input data!\n"), _DH()););
        }

    }
    return ret;
}

/*
    clsLEAmDNS2_Host::queryHost

*/
clsLEAMDNSHost::clsQuery::clsAnswerAccessor::vector clsLEAMDNSHost::queryHost(const char* p_pcHostName,
        const uint16_t p_u16Timeout)
{
    clsLEAMDNSHost::clsQuery::clsAnswerAccessor::vector ret;

    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s queryHost '%s.local'\n"), _DH(), p_pcHostName););

    if ((p_pcHostName) && (*p_pcHostName) &&
            (p_u16Timeout) &&
            (_removeLegacyQuery()))
    {
        std::list<clsQuery*> queries;

                clsQuery*    pQuery = 0;
                if (((pQuery = _allocQuery(clsQuery::enuQueryType::Host))) &&
                        (_buildDomainForHost(p_pcHostName, pQuery->m_Domain)))
                {
                    if (((pQuery->m_bStaticQuery = true)) && (_sendQuery(*pQuery)))
                    {
                        queries.push_back(pQuery);
                    }
                    else
                    {
                        // FAILED to send query
                        _removeQuery(pQuery);
                    }
                }


        if (queries.size())
        {
            // Wait for answers to arrive
            DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s queryHost: Waiting %u ms for answers...\n"), _DH(), p_u16Timeout););
            //XXXFIXME could this delay be ASYNC?
            delay(p_u16Timeout);

            // All answers should have arrived by now -> stop adding new answers

            for (auto& q : queries)
            {
                q->m_bAwaitingAnswers = false;
                ret.insert(ret.end(), std::make_move_iterator(q->answerAccessors().begin()), std::make_move_iterator(q->answerAccessors().end()));
            }
        }
        else
        {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s queryHost: INVALID input data!\n"), _DH()););
        }
    }

    return ret;
}
/*
    clsLEAmDNS2_Host::removeQuery

*/
bool clsLEAMDNSHost::removeQuery(void)
{
    return _removeLegacyQuery();
}

/*
    clsLEAmDNS2_Host::hasQuery

*/
bool clsLEAMDNSHost::hasQuery(void)
{
    return (0 != _findLegacyQuery());
}

/*
    clsLEAmDNS2_Host::getQuery

*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::getQuery(void)
{
    return _findLegacyQuery();
}

/*
    clsLEAmDNS2_Host::installServiceQuery (answer)

*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::installServiceQuery(const char* p_pcService,
        const char* p_pcProtocol,
        clsLEAMDNSHost::clsQuery::QueryCallbackAnswerFn p_fnCallbackAnswer)
{
    clsQuery*   pQuery = 0;
        if (pQuery = _installServiceQuery(p_pcService, p_pcProtocol))
        {
            pQuery->m_fnCallbackAnswer = p_fnCallbackAnswer;
        }
    return pQuery;
}

