esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS2Host.cpp
/*
    clsLEAmDNS2_Host::_leaveMulticastGroups
*/
bool clsLEAMDNSHost::_leaveMulticastGroups()
{
    bool    bResult = false;

    for (netif* pNetIf = netif_list; pNetIf; pNetIf = pNetIf->next)
        if (netif_is_up(pNetIf))
        {
            bResult = true;
            /*  _resetProbeStatus(false);   // Stop probing
                _releaseQueries();
                _releaseServices();
                _releaseHostName();*/

            // Leave multicast group(s)
#ifdef MDNS_IPV4_SUPPORT
            ip_addr_t   multicast_addr_V4 = DNS_MQUERY_IPV4_GROUP_INIT;
#if LWIP_VERSION_MAJOR == 1
            if (ERR_OK != igmp_leavegroup(ip_2_ip4(pNetIf->ip_addr), ip_2_ip4(&multicast_addr_V4)))
#else
            if (ERR_OK != igmp_leavegroup_netif(pNetIf, ip_2_ip4(&multicast_addr_V4)))
#endif
            {
                DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("\n")););
            }
#endif
#ifdef MDNS_IPV6_SUPPORT
            ip_addr_t   multicast_addr_V6 = DNS_MQUERY_IPV6_GROUP_INIT;
            if (ERR_OK != mld6_leavegroup_netif(pNetIf, ip_2_ip6(&multicast_addr_V6)/*&(multicast_addr_V6.u_addr.ip6)*/))
            {
                DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("\n")););
            }
#endif
        }
    return bResult;
}


/*
    PROCESSING
*/

/*
    clsLEAmDNS2_Host::_processUDPInput
*/
bool clsLEAMDNSHost::_processUDPInput(void)
{
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _processUDPInput\n"), _DH()););

    bool    bResult = _parseMessage();

    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf_P(PSTR("%s processUDPInput: FAILED!\n"), _DH()););

    return bResult;
}


/*
    DOMAIN NAMES
*/

/*
    clsLEAmDNS2_Host::_allocDomainName
*/
bool clsLEAMDNSHost::_allocDomainName(const char* p_pcNewDomainName,
                                      char*& p_rpcDomainName)
{
    bool    bResult = false;

    _releaseDomainName(p_rpcDomainName);

    size_t  stLength = 0;
    if ((p_pcNewDomainName) &&
            (clsConsts::stDomainLabelMaxLength >= (stLength = strlen(p_pcNewDomainName))))   // char max size for a single label
    {
        // Copy in hostname characters as lowercase
        if ((bResult = (0 != (p_rpcDomainName = new char[stLength + 1]))))
        {
#ifdef MDNS_FORCE_LOWERCASE_HOSTNAME
            size_t i = 0;
            for (; i < stLength; ++i)
            {
                p_rpcDomainName[i] = (isupper(p_pcNewDomainName[i]) ? tolower(p_pcNewDomainName[i]) : p_pcNewDomainName[i]);
            }
            p_rpcDomainName[i] = 0;
#else
            strncpy(p_rpcDomainName, p_pcNewDomainName, (stLength + 1));
#endif
        }
    }
    return bResult;
}

/*
    clsLEAmDNS2_Host::_releaseDomainName
*/
bool clsLEAMDNSHost::_releaseDomainName(char*& p_rpcDomainName)
{
    bool    bResult;
    if ((bResult = (0 != p_rpcDomainName)))
    {
        delete[] p_rpcDomainName;
        p_rpcDomainName = 0;
    }
    return bResult;
}

/*
    clsLEAmDNS2_Host::_allocHostName
*/
bool clsLEAMDNSHost::_allocHostName(const char* p_pcHostName)
{
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _allocHostName (%s)\n"), _DH(), p_pcHostName););
    return _allocDomainName(p_pcHostName, m_pcHostName);
}

/*
    clsLEAmDNS2_Host::_releaseHostName
*/
bool clsLEAMDNSHost::_releaseHostName(void)
{
    return _releaseDomainName(m_pcHostName);
}

/*
    clsLEAmDNS2_Host::_allocDefaultInstanceName
*/
bool clsLEAMDNSHost::_allocDefaultInstanceName(const char* p_pcDefaultInstanceName)
{
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _allocDefaultInstanceName (%s)\n"), _DH(), p_pcDefaultInstanceName););
    return _allocDomainName(p_pcDefaultInstanceName, m_pcDefaultInstanceName);
}

/*
    clsLEAmDNS2_Host::_releaseDefaultInstanceName
*/
bool clsLEAMDNSHost::_releaseDefaultInstanceName(void)
{
    return _releaseDomainName(m_pcDefaultInstanceName);
}

/*
    clsLEAmDNS2_Host::_instanceName
*/
const char* clsLEAMDNSHost::_instanceName(const char* p_pcInstanceName,
        bool p_bReturnZero /*= true*/) const
{
    return (p_pcInstanceName ? : (m_pcDefaultInstanceName ? : (m_pcHostName ? : (p_bReturnZero ? 0 : "-"))));
}


/*
    SERVICE TXT
*/

/*
    clsLEAmDNS2_Host::_collectServiceTxts
*/
bool clsLEAMDNSHost::_collectServiceTxts(clsLEAMDNSHost::clsService & p_rService)
{
    if (p_rService.m_fnTxtCallback)
    {
        p_rService.m_fnTxtCallback(p_rService);
    }
    return true;
}

/*
    clsLEAmDNS2_Host::_releaseTempServiceTxts
*/
bool clsLEAMDNSHost::_releaseTempServiceTxts(clsLEAMDNSHost::clsService & p_rService)
{
    return (p_rService.m_Txts.removeTempTxts());
}


/*

    QUERIES

*/

/*
    MDNSResponder::_allocQuery

*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::_allocQuery(clsLEAMDNSHost::clsQuery::enuQueryType p_QueryType)
{
    clsQuery*    pQuery = new clsQuery(p_QueryType);
    if (pQuery)
    {
        // Link to query list
        m_Queries.push_back(pQuery);
    }
    return pQuery;
}

/*
    MDNSResponder:clsHost:::_removeQuery

*/
bool clsLEAMDNSHost::_removeQuery(clsLEAMDNSHost::clsQuery * p_pQuery)
{
    bool    bResult = false;

    clsQuery::list::iterator   it(p_pQuery
                                  ? std::find(m_Queries.begin(), m_Queries.end(), p_pQuery)
                                  : m_Queries.end());
    if (m_Queries.end() != it)
    {
        m_Queries.erase(it);
        delete p_pQuery;

        bResult = true;
    }
    else
    {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _releaseQuery: INVALID query!"), _DH()););
    }
    return bResult;
}

/*
    clsLEAmDNS2_Host::_removeLegacyQuery

*/
bool clsLEAMDNSHost::_removeLegacyQuery(void)
{
    clsQuery*    pLegacyQuery = 0;
    return (((pLegacyQuery = _findLegacyQuery()))
            ? _removeQuery(pLegacyQuery)
            : true);
}

/*
    clsLEAmDNS2_Host::_findLegacyQuery

*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::_findLegacyQuery(void)
{
    clsQuery*   pLegacyQuery = 0;

    for (clsQuery* pQuery : m_Queries)
    {
        if (pQuery->m_bStaticQuery)
        {
            pLegacyQuery = pQuery;
            break;
        }
    }
    return pLegacyQuery;
}

